01_Offlines/Offline_4_Load_Testing_JMeter/2305025/report1/final_html_dashboard/statistics.json
{
  "/api/download/256" : {
    "transaction" : "/api/download/256",
    "sampleCount" : 50,
    "errorCount" : 36,
    "errorPct" : 72.0,
    "meanResTime" : 591.4599999999999,
    "medianResTime" : 390.5,
    "minResTime" : 54.0,
    "maxResTime" : 2237.0,
    "pct1ResTime" : 1599.6999999999998,
    "pct2ResTime" : 2129.9999999999995,
    "pct3ResTime" : 2237.0,
    "throughput" : 0.5125891905191503,
    "receivedKBytesPerSec" : 131.3624933043037,
    "sentKBytesPerSec" : 0.18421174034281965
  },
  "/login" : {
    "transaction" : "/login",
    "sampleCount" : 50,
    "errorCount" : 3,
    "errorPct" : 6.0,
    "meanResTime" : 71.12000000000002,
    "medianResTime" : 43.0,
    "minResTime" : 14.0,
    "maxResTime" : 550.0,
    "pct1ResTime" : 92.49999999999997,
    "pct2ResTime" : 354.3499999999988,
    "pct3ResTime" : 550.0,
    "throughput" : 0.5159852221832367,
    "receivedKBytesPerSec" : 0.7785128596416998,
    "sentKBytesPerSec" : 0.22070461651978288
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 250,
    "errorCount" : 142,
    "errorPct" : 56.8,
    "meanResTime" : 361.46399999999977,
    "medianResTime" : 227.5,
    "minResTime" : 14.0,
    "maxResTime" : 2237.0,
    "pct1ResTime" : 841.2,
    "pct2ResTime" : 1160.5999999999995,
    "pct3ResTime" : 2132.4000000000005,
    "throughput" : 2.4989754200777683,
    "receivedKBytesPerSec" : 155.36940401310463,
    "sentKBytesPerSec" : 0.9551747845883188
  },
  "/courses" : {
    "transaction" : "/courses",
    "sampleCount" : 50,
    "errorCount" : 50,
    "errorPct" : 100.0,
    "meanResTime" : 443.86000000000007,
    "medianResTime" : 389.5,
    "minResTime" : 213.0,
    "maxResTime" : 1278.0,
    "pct1ResTime" : 810.6999999999998,
    "pct2ResTime" : 1143.5499999999997,
    "pct3ResTime" : 1278.0,
    "throughput" : 0.5119541289100497,
    "receivedKBytesPerSec" : 22.20151074463728,
    "sentKBytesPerSec" : 0.2014819472175293
  },
  "/notices" : {
    "transaction" : "/notices",
    "sampleCount" : 50,
    "errorCount" : 41,
    "errorPct" : 82.0,
    "meanResTime" : 380.50000000000006,
    "medianResTime" : 378.5,
    "minResTime" : 125.0,
    "maxResTime" : 856.0,
    "pct1ResTime" : 680.9,
    "pct2ResTime" : 768.05,
    "pct3ResTime" : 856.0,
    "throughput" : 0.5120432574143864,
    "receivedKBytesPerSec" : 3.7593175871497624,
    "sentKBytesPerSec" : 0.19801672845321974
  },
  "/" : {
    "transaction" : "/",
    "sampleCount" : 50,
    "errorCount" : 12,
    "errorPct" : 24.0,
    "meanResTime" : 320.38000000000005,
    "medianResTime" : 113.0,
    "minResTime" : 21.0,
    "maxResTime" : 1615.0,
    "pct1ResTime" : 1134.8999999999999,
    "pct2ResTime" : 1335.8999999999994,
    "pct3ResTime" : 1615.0,
    "throughput" : 0.509803521722728,
    "receivedKBytesPerSec" : 1.211779074094844,
    "sentKBytesPerSec" : 0.17524496059218778
  }
}