01_Offlines/Offline_4_Load_Testing_JMeter/2305025/report2/final_html_dashboard/statistics.json
{
  "/api/download/256" : {
    "transaction" : "/api/download/256",
    "sampleCount" : 100,
    "errorCount" : 80,
    "errorPct" : 80.0,
    "meanResTime" : 791.0199999999999,
    "medianResTime" : 536.0,
    "minResTime" : 94.0,
    "maxResTime" : 3938.0,
    "pct1ResTime" : 1821.1000000000001,
    "pct2ResTime" : 2703.299999999996,
    "pct3ResTime" : 3929.8799999999956,
    "throughput" : 1.0067755997865637,
    "receivedKBytesPerSec" : 258.00886056913026,
    "sentKBytesPerSec" : 0.36180998117329627
  },
  "/login" : {
    "transaction" : "/login",
    "sampleCount" : 100,
    "errorCount" : 9,
    "errorPct" : 9.0,
    "meanResTime" : 97.21000000000001,
    "medianResTime" : 58.0,
    "minResTime" : 7.0,
    "maxResTime" : 739.0,
    "pct1ResTime" : 172.4000000000001,
    "pct2ResTime" : 501.39999999999986,
    "pct3ResTime" : 737.4599999999992,
    "throughput" : 1.0201895512186165,
    "receivedKBytesPerSec" : 1.539250836555432,
    "sentKBytesPerSec" : 0.39950782230338394
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 500,
    "errorCount" : 300,
    "errorPct" : 60.0,
    "meanResTime" : 413.1059999999998,
    "medianResTime" : 284.0,
    "minResTime" : 7.0,
    "maxResTime" : 3938.0,
    "pct1ResTime" : 966.8000000000001,
    "pct2ResTime" : 1346.6,
    "pct3ResTime" : 2716.660000000003,
    "throughput" : 4.939784032642093,
    "receivedKBytesPerSec" : 307.1223890154023,
    "sentKBytesPerSec" : 1.888116670289175
  },
  "/courses" : {
    "transaction" : "/courses",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 519.1799999999998,
    "medianResTime" : 419.0,
    "minResTime" : 245.0,
    "maxResTime" : 1897.0,
    "pct1ResTime" : 990.4000000000005,
    "pct2ResTime" : 1264.1999999999998,
    "pct3ResTime" : 1892.0299999999975,
    "throughput" : 1.0080543542907834,
    "receivedKBytesPerSec" : 43.71549776463947,
    "sentKBytesPerSec" : 0.39672451638592354
  },
  "/notices" : {
    "transaction" : "/notices",
    "sampleCount" : 100,
    "errorCount" : 88,
    "errorPct" : 88.0,
    "meanResTime" : 436.25000000000006,
    "medianResTime" : 376.5,
    "minResTime" : 171.0,
    "maxResTime" : 1578.0,
    "pct1ResTime" : 845.5,
    "pct2ResTime" : 1011.3499999999992,
    "pct3ResTime" : 1577.94,
    "throughput" : 1.0097338341613151,
    "receivedKBytesPerSec" : 7.413260708227311,
    "sentKBytesPerSec" : 0.39048300617957105
  },
  "/" : {
    "transaction" : "/",
    "sampleCount" : 100,
    "errorCount" : 23,
    "errorPct" : 23.0,
    "meanResTime" : 221.86999999999992,
    "medianResTime" : 147.0,
    "minResTime" : 22.0,
    "maxResTime" : 1150.0,
    "pct1ResTime" : 480.50000000000034,
    "pct2ResTime" : 1090.4499999999955,
    "pct3ResTime" : 1149.8899999999999,
    "throughput" : 1.0099479876786346,
    "receivedKBytesPerSec" : 2.400599025400192,
    "sentKBytesPerSec" : 0.38366188203807505
  }
}